## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 5 to change, 9 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                RESOURCE                                |
|----------|------------------------------------------------------------------------|
| add      | `aws_route53_record.superset_validation[&quot;*.superset.alpha.canada.ca&quot;]` |
|          | `aws_route53_record.superset_validation[&quot;superset.alpha.canada.ca&quot;]`   |
| update   | `aws_lb_listener.superset`                                             |
|          | `aws_wafv2_web_acl.superset`                                           |
|          | `module.celery_beat_ecs.aws_ecs_service.this`                          |
|          | `module.celery_worker_ecs.aws_ecs_service.this`                        |
|          | `module.superset_ecs.aws_ecs_service.this`                             |
| recreate | `aws_acm_certificate.superset`                                         |
|          | `aws_acm_certificate_validation.superset`                              |
|          | `aws_ecs_task_definition.superset_upgrade`                             |
|          | `aws_route53_record.superset_A`                                        |
|          | `module.celery_beat_ecs.aws_ecs_task_definition.this`                  |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this`                |
|          | `module.superset_ecs.aws_ecs_task_definition.this`                     |
| delete   | `aws_route53_record.superset_validation[&quot;*.superset.cdssandbox.xyz&quot;]`  |
|          | `aws_route53_record.superset_validation[&quot;superset.cdssandbox.xyz&quot;]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.superset must be replaced
+/- resource "aws_acm_certificate" "superset" {
      ~ arn                       = "arn:aws:acm:ca-central-1:066023111852:certificate/72d2b869-9249-496e-8dfd-f63b9558fd6c" -> (known after apply)
      ~ domain_name               = "superset.cdssandbox.xyz" -> "superset.alpha.canada.ca" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.superset.cdssandbox.xyz"
              - resource_record_name  = "_5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_dbe8ba769dd21b49ad93b1513103dca1.mhbtsbpdnt.acm-validations.aws."
            },
          - {
              - domain_name           = "superset.cdssandbox.xyz"
              - resource_record_name  = "_5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_dbe8ba769dd21b49ad93b1513103dca1.mhbtsbpdnt.acm-validations.aws."
            },
          + {
              + domain_name           = "*.superset.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "superset.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:066023111852:certificate/72d2b869-9249-496e-8dfd-f63b9558fd6c" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2025-02-12T23:59:59Z" -> (known after apply)
      ~ not_before                = "2024-01-15T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "*.superset.cdssandbox.xyz",
          - "superset.cdssandbox.xyz",
          + "*.superset.alpha.canada.ca",
          + "superset.alpha.canada.ca",
        ]
        tags                      = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (4 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.superset must be replaced
-/+ resource "aws_acm_certificate_validation" "superset" {
      ~ certificate_arn         = "arn:aws:acm:ca-central-1:066023111852:certificate/72d2b869-9249-496e-8dfd-f63b9558fd6c" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "2024-01-15 20:23:57.305 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
    }

  # aws_ecs_task_definition.superset_upgrade must be replaced
-/+ resource "aws_ecs_task_definition" "superset_upgrade" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade:37" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (4 unchanged elements hidden)
                        {
                            name  = "THUMBNAIL_SELENIUM_USER"
                            value = "cache-warmer"
                        },
                      ~ {
                            name  = "WEBDRIVER_BASEURL"
                          ~ value = "https://superset.cdssandbox.xyz" -> "https://superset.alpha.canada.ca"
                        },
                    ]
                    name             = "superset-upgrade"
                    # (12 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "superset-upgrade" -> (known after apply)
      ~ revision                 = 37 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lb_listener.superset will be updated in-place
  ~ resource "aws_lb_listener" "superset" {
      ~ certificate_arn   = "arn:aws:acm:ca-central-1:066023111852:certificate/72d2b869-9249-496e-8dfd-f63b9558fd6c" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ca-central-1:066023111852:listener/app/superset-prod/d9046c2b02959d94/bc87e8a8f95ad682"
        tags              = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.superset_A must be replaced
-/+ resource "aws_route53_record" "superset_A" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "superset.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z1002805AO9YV5MDJK3J_superset.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "superset.cdssandbox.xyz" -> "superset.alpha.canada.ca" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z1002805AO9YV5MDJK3J" -> "Z02262342WGVXW29FH20L" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.superset_validation["*.superset.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "superset_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z02262342WGVXW29FH20L"
    }

  # aws_route53_record.superset_validation["*.superset.cdssandbox.xyz"] will be destroyed
  # (because key ["*.superset.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "superset_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz" -> null
      - id                               = "Z1002805AO9YV5MDJK3J__5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz" -> null
      - records                          = [
          - "_dbe8ba769dd21b49ad93b1513103dca1.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z1002805AO9YV5MDJK3J" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.superset_validation["superset.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "superset_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z02262342WGVXW29FH20L"
    }

  # aws_route53_record.superset_validation["superset.cdssandbox.xyz"] will be destroyed
  # (because key ["superset.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "superset_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz" -> null
      - id                               = "Z1002805AO9YV5MDJK3J__5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_5c18dcacf9eb28eae37338bb81cff22b.superset.cdssandbox.xyz" -> null
      - records                          = [
          - "_dbe8ba769dd21b49ad93b1513103dca1.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z1002805AO9YV5MDJK3J" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_zone.superset_prod has moved to aws_route53_zone.superset
    resource "aws_route53_zone" "superset" {
        id                  = "Z02262342WGVXW29FH20L"
        name                = "superset.alpha.canada.ca"
        tags                = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.superset will be updated in-place
  ~ resource "aws_wafv2_web_acl" "superset" {
        id                          = "01023b01-f866-450a-9eab-8359b1b45d4f"
        name                        = "superset_lb"
        tags                        = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - rule {
          - name     = "InvalidHost" -> null
          - priority = 1 -> null

          - action {
              - block {
                }
            }

          - statement {
              - not_statement {
                  - statement {
                      - byte_match_statement {
                          - positional_constraint = "EXACTLY" -> null
                          - search_string         = "superset.cdssandbox.xyz" -> null

                          - field_to_match {
                              - single_header {
                                  - name = "host" -> null
                                }
                            }

                          - text_transformation {
                              - priority = 1 -> null
                              - type     = "COMPRESS_WHITE_SPACE" -> null
                            }
                          - text_transformation {
                              - priority = 2 -> null
                              - type     = "LOWERCASE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "InvalidHost" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRuleSet" -> null
          - priority = 50 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesCommonRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 30 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 40 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "InvalidHost"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + not_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "superset.alpha.canada.ca"

                          + field_to_match {
                              + single_header {
                                  + name = "host"
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "InvalidHost"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 50

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 40

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "celery-beat"
      + task_role_arn        = (known after apply)
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:70" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:70" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (4 unchanged elements hidden)
                        {
                            name  = "THUMBNAIL_SELENIUM_USER"
                            value = "cache-warmer"
                        },
                      ~ {
                            name  = "WEBDRIVER_BASEURL"
                          ~ value = "https://superset.cdssandbox.xyz" -> "https://superset.alpha.canada.ca"
                        },
                    ]
                    name                   = "celery-beat"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "celery-beat" -> (known after apply)
      ~ revision                 = 70 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.celery_worker_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "celery-worker"
      + task_role_arn        = (known after apply)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:75" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:75" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (4 unchanged elements hidden)
                        {
                            name  = "THUMBNAIL_SELENIUM_USER"
                            value = "cache-warmer"
                        },
                      ~ {
                            name  = "WEBDRIVER_BASEURL"
                          ~ value = "https://superset.cdssandbox.xyz" -> "https://superset.alpha.canada.ca"
                        },
                    ]
                    name                   = "celery-worker"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "celery-worker" -> (known after apply)
      ~ revision                 = 75 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "superset"
      + task_role_arn        = (known after apply)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:88" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:88" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                      ~ {
                            name  = "GOOGLE_AUTH_DOMAIN"
                          ~ value = "superset.cdssandbox.xyz" -> "superset.alpha.canada.ca"
                        },
                        {
                            name  = "GOOGLE_OAUTH_EMAIL_DOMAIN"
                            value = "cds-snc.ca"
                        },
                        # (5 unchanged elements hidden)
                        {
                            name  = "THUMBNAIL_SELENIUM_USER"
                            value = "cache-warmer"
                        },
                      ~ {
                            name  = "WEBDRIVER_BASEURL"
                          ~ value = "https://superset.cdssandbox.xyz" -> "https://superset.alpha.canada.ca"
                        },
                    ]
                    name                   = "superset"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "superset" -> (known after apply)
      ~ revision                 = 88 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 5 to change, 9 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
